/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   p_atoi.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jisookim <jisookim@student.42seoul.kr>     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/08/04 12:10:56 by jisookim          #+#    #+#             */
/*   Updated: 2022/08/04 15:29:34 by jisookim         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../include/philo.h"

size_t	p_atoi(char *arg)
{
	// 음수 안됨 
	// size_t 범위가 가변적이기 때문에
	// 
	// zu(size_t) 범위에 드는지 확인
	// 범위 
}